{
  "earlyLife": [
    "You got stung by a jellyfish on a family outing in Batangas.",
    "You had a Jollibee-themed first birthday party with spaghetti and hotdogs on sticks.",
    "You discovered you love playing patintero with neighborhood kids.",
    "You tried a super sour sinigang for the first time and cried.",
    "Your lola introduced you to 'mano po' to show respect.",
    "You got lost in the palengke (wet market) while clinging to your mother's dress.",
    "A friendly tindera gave you free samples at the sari-sari store.",
    "You spent hours watching local noon-time shows with your grandparents.",
    "You sneaked out at night to catch fireflies with other kids.",
    "Your parents argued about electricity bills, so the TV time was cut short.",
    "A stray cat followed you home, and you secretly fed it leftover adobo.",
    "You slipped during a Santacruzan parade practice and scraped your knee.",
    "You learned basic Tagalog words by singing nursery rhymes.",
    "You tripped on your tsinelas and accidentally spilled lugaw on yourself.",
    "A big brownout forced you to sleep outside under the stars with family.",
    "You discovered a love for turon after tasting it at a local fiesta.",
    "You tried to help your father wash the tricycle but ended up soaked.",
    "Your playmates introduced you to piko, and you excelled in hopping squares.",
    "You visited your relatives in the province and rode a carabao for fun.",
    "You got scolded for riding the jeepney alone to buy candy.",
    "You encountered your first bagyo (typhoon) and had to stay indoors for days.",
    "Your older sibling teased you until you burst into tears at the dinner table.",
    "You received your first medal in a school recognition day.",
    "You stole a sip of your lolo’s kapeng barako and found it too bitter.",
    "A neighbor’s dog chased you, causing you to drop your merienda.",
    "You colored on the walls with crayons, annoying your nanay.",
    "You watched a local drumming parade at the barangay fiesta.",
    "You caught a mild fever but recovered after a visit to the manghihilot.",
    "You helped your tita cook bibingka for a small family gathering.",
    "Your family had a swimming outing at a local resort, and you almost drowned.",
    "You developed a sweet tooth for taho every morning.",
    "You got a goldfish from a tiangge but it died within a week.",
    "You discovered you have a hidden talent for singing kundiman.",
    "Your mother forced you to take a daily afternoon nap, or 'siesta.'",
    "You accompanied your father to fix the roof after heavy rains.",
    "You joined a local kiddie pageant and won 'Best in Costume.'",
    "You lost your first baby tooth while eating lumpia shanghai.",
    "A cousin taught you how to play PSP, and you got hooked on Tekken.",
    "You got allergic rashes from eating too many mangos.",
    "You were scolded for leaving melted ice candy wrappers around the house.",
    "You received your first mini rosary from your devout lola.",
    "You tried halo-halo for the first time and hated the beans in it.",
    "A local tricycle driver gave you a free ride because he knew your parents.",
    "You cried when your wooden yoyo broke in half.",
    "You joined a local kids' choir but forgot your lines mid-performance.",
    "You fell asleep on a banca ride while visiting relatives by the river.",
    "You loved rainy days because you could play in the mud with your friends.",
    "You found a stray puppy in the street and secretly adopted it.",
    "Your ate taught you how to do basic math, boosting your smarts.",
    "You suffered a severe allergic reaction to shellfish and couldn't breathe in time. You died.",
    "You were so shy you refused to greet relatives, making them think you’re masungit."
  ],
  "teenage": [
    "You joined your school’s folk dance club and performed tinikling.",
    "You started a part-time job as a tutor for younger kids in the barangay.",
    "Your barkada convinced you to sneak out for midnight halo-halo.",
    "You had a heated argument with your parents about curfew hours.",
    "You developed a crush on your seatmate who always lent you a ballpen.",
    "You tried to lighten your skin using papaya soap, following a local trend.",
    "You sneaked your phone into class to play Mobile Legends.",
    "You joined the high school basketball varsity team.",
    "You formed a barkada band to join the local Battle of the Bands.",
    "You lied to your parents about staying overnight at a friend’s house.",
    "You were caught passing love notes in class and got scolded by the teacher.",
    "You joined a cleaning drive in your barangay to earn extra school credit.",
    "You auditioned for a Filipino drama club but froze on stage.",
    "You got addicted to K-pop and started learning Korean phrases as well.",
    "You discovered you have a knack for cooking sinigang, impressing your family.",
    "You and your friends took tricycles to explore a nearby town without permission.",
    "You binge-watched Pinoy teleseryes instead of studying for finals.",
    "You tried underage drinking at a friend’s birthday and felt sick afterward.",
    "You got a cameo role in your school's Sarsuwela production.",
    "You sold biko and puto at school to raise funds for a field trip.",
    "You nearly failed your math exam due to procrastination.",
    "Your father insisted on teaching you to drive the family jeepney at 16.",
    "You got scolded by the principal for wearing makeup to school.",
    "You considered running for SSG (student government) but lost the election.",
    "You hosted a small budots dance party with your barkada.",
    "You learned basic sign language to help a classmate with hearing impairment.",
    "You experienced heartbreak when your crush started dating someone else.",
    "You tried to launch a small online selling business for accessories.",
    "You joined a church youth camp but felt homesick by day two.",
    "You started a vlog about teenage life in the Philippines.",
    "You learned how to do your own laundry to impress your parents.",
    "You wrote a spoken-word piece about Filipino identity and performed it in class.",
    "You considered dropping out but a guidance counselor convinced you otherwise.",
    "You joined a municipal-level quiz bee and placed third.",
    "You helped your mother manage a sari-sari store on weekends.",
    "You discovered you excel at writing Tagalog poems.",
    "You tried sneaking into a local bar but were caught and sent home.",
    "You got chosen to represent your school in a barangay day program.",
    "You took up a part-time job at a fast-food chain to save for college.",
    "You became a peer counselor to help classmates with personal issues.",
    "You dyed your hair a bright color, causing a family uproar.",
    "You tried smoking behind the school gym and coughed uncontrollably.",
    "You joined a local dance troupe that performed during fiestas.",
    "You read Jose Rizal’s Noli Me Tangere for extra credit and found it fascinating.",
    "You practiced singing karaoke daily, annoying your neighbors.",
    "You taught yourself to code, dreaming of a better future in tech.",
    "You got into an online feud with a classmate over petty gossip.",
    "You started wearing contact lenses to change your look.",
    "You balanced your time between after-school tutorials and housekeeping chores.",
    "You developed an interest in photography, snapping pictures of local festivals."
  ],
  "adulthood": [
    "You landed an entry-level office job at a BPO company.",
    "You moved into a small boarding house near your workplace.",
    "You considered applying for an OFW position in the Middle East.",
    "You joined a barkada outing in Boracay and overspent your savings.",
    "You discovered a passion for cooking and started a small catering gig.",
    "You took a chance on franchising a milk tea stall.",
    "You had a minor car accident on EDSA but no major injuries.",
    "You fell in love with someone from your office and started dating.",
    "You got scammed by a pyramid scheme, losing half your money.",
    "You reconnected with old high school friends for a road trip to Vigan.",
    "You joined a local marathon to improve your health.",
    "You earned a promotion for your dedication and performance.",
    "You tried to apply for a bank loan to buy a small condo unit.",
    "You discovered you have a knack for real estate and started flipping properties.",
    "You had a heated argument with your landlord about sudden rent increases.",
    "You saved enough to buy your own motorcycle for daily commuting.",
    "You volunteered in a community outreach program teaching street children.",
    "You sold homemade siomai as a side hustle to pay bills.",
    "You got engaged to your partner after a romantic proposal in Palawan.",
    "You started posting vlogs about daily Filipino city life, gaining followers.",
    "You overcame a dengue scare after a week in the hospital.",
    "You started learning a new foreign language for potential migration.",
    "You joined a local photography club and sold your prints at small bazaars.",
    "You adopted a stray cat, naming it Lucky, to keep you company at home.",
    "You attended a relative’s funeral in the province and re-examined your priorities.",
    "You discovered your partner’s interest in going abroad, causing friction.",
    "You lost your job unexpectedly due to company downsizing.",
    "You became a Grab driver for extra income, meeting lots of interesting passengers.",
    "You joined a writing workshop to hone your creative Tagalog short stories.",
    "You tried your luck on a small business in Divisoria but struggled with rent.",
    "You discovered you have high cholesterol and had to diet strictly.",
    "You hosted your first family reunion at your small apartment.",
    "You tested your luck at a casino in Parañaque but lost all bets.",
    "You found out your mother is ill, prompting you to send more money home.",
    "You tried a networking business hawking health supplements to your friends.",
    "You took up night classes to earn a vocational certificate.",
    "You joined a local community theater and starred in a short comedic play.",
    "You co-founded a small start-up with your barkada, hoping to break even soon.",
    "You tried investing in the stock market but picked the wrong stocks.",
    "You took a leap of faith and proposed to your longtime partner.",
    "You decided to run for kagawad (barangay council) but didn’t get many votes.",
    "You discovered an old passion for painting and sold your art for side income.",
    "You started reading daily devotionals, seeking spiritual guidance.",
    "You overcame a serious breakup by focusing on your personal growth.",
    "You launched a homemade dessert business, shipping goodies nationwide.",
    "You tried an online Master’s program but found it too demanding while working.",
    "You had to care for a younger sibling who moved in for college.",
    "You started journaling about your daily struggles and triumphs.",
    "You performed at a company talent show, singing an OPM ballad.",
    "You realized you might want children soon, discussing it with your partner."
  ],
  "midlife": [
    "You faced a mild health scare that prompted you to see a cardiologist.",
    "You discovered your passion for urban gardening on your small balcony.",
    "You had a serious argument with your spouse about your children’s future.",
    "You considered switching careers to find more fulfillment.",
    "You began to fear you might not have saved enough for retirement.",
    "You started an eatery featuring local Filipino comfort dishes.",
    "You found an old high school friend on social media and reconnected.",
    "You decided to invest in a second-hand van for a small family travel business.",
    "You discovered you have hypertension and started taking maintenance meds.",
    "You taught your teenage child how to do basic budgeting.",
    "You felt overshadowed at work by younger, tech-savvy coworkers.",
    "You filed a complaint against a noisy karaoke neighbor every weekend.",
    "You took a personal retreat to a local monastery to find inner peace.",
    "You considered adopting a child but worried about finances.",
    "You realized your father’s aging needed constant support and care.",
    "You tried a Zumba class with other middle-aged folks for fitness.",
    "You had a big family reunion at a rented pool resort, reconnecting with cousins.",
    "You purchased a small farmland to start a weekend farm life.",
    "You discovered your spouse’s hidden debts and had to restructure finances.",
    "You had to pay for your child’s private school tuition, straining your budget.",
    "You auditioned for a local TV commercial but didn’t get the part.",
    "You resumed a hobby making Filipino handicrafts for an online store.",
    "You got invited to join a local civic organization and found it rewarding.",
    "You arranged a debut party for your daughter, which cost more than expected.",
    "You had a confrontation with a sibling over inheritance issues.",
    "You tested your luck with the PCSO lottery but never won big.",
    "You tried building a small piggery business, but it struggled in your area.",
    "You experienced partial hair loss and tried herbal remedies from the suki vendor.",
    "You discovered you enjoy volunteering at an orphanage on weekends.",
    "You attended your child’s graduation and felt proud but nostalgic.",
    "You tried online dating, unsure if it’s wise at your age.",
    "You fought with your manager about a promotion you felt you deserved.",
    "You joined a monthly baking club, selling pastries at local events.",
    "You donated part of your salary to a cause supporting street children.",
    "You overcame a minor midlife crisis by exploring local tourist spots.",
    "You joined a protest against a controversial local government project.",
    "You had a short hospital stay for kidney stones but recovered quickly.",
    "You discovered an interest in genealogical research about your Filipino roots.",
    "You took a sabbatical from work to focus on mental health.",
    "You started to question if you should retire early to enjoy life more.",
    "You argued with your grown child about their own career path choices.",
    "You tried investing in a new coffee shop franchise but faced tough competition.",
    "You lost an old friend to illness and questioned your priorities.",
    "You organized a major local fundraiser for typhoon victims.",
    "You decided to sponsor a scholarship for a deserving barangay youth.",
    "You tested out renting a condo in the city to shorten your commute.",
    "You had a meltdown about your diminishing looks and tried anti-aging creams.",
    "You realized your job has become unfulfilling and began exploring new roles.",
    "You got into a big legal dispute over property lines with your neighbor."
  ],
  "oldAge": [
    "You retired from your long-time office job to focus on family.",
    "You moved in with your eldest child, following Filipino multi-generational living.",
    "You joined a senior citizens group, traveling by bus to Baguio for a retreat.",
    "You helped plan your grandchild’s baptism and felt overjoyed.",
    "You began writing your memoir of Filipino experiences for future generations.",
    "You had to rely on daily maintenance meds for diabetes.",
    "You discovered a love for raising ornamental plants, often called 'plantita/o' style.",
    "You visited your old hometown in the province, shedding tears of nostalgia.",
    "You tried an online streaming site but couldn’t figure out how to use it.",
    "You sold your property in Metro Manila and moved to a quieter town.",
    "You endured a mild stroke but worked hard on physical therapy.",
    "You insisted on giving aginaldo (cash gifts) to every apo at Christmas.",
    "You had a massive 60th birthday party with a surprise program from your grandchildren.",
    "You reconnected with a longtime friend from your youth after decades apart.",
    "You felt lonely after your spouse passed away and considered group activities.",
    "You spent more time praying the rosary and lighting candles at church.",
    "You had to rely on a part-time caregiver for daily tasks.",
    "You grew close to a pen-pal overseas, exchanging stories and photos.",
    "You offered life advice to a younger neighbor going through heartbreak.",
    "You allowed a relative to manage your pension but worried about mismanagement.",
    "You launched a small vlog about senior life in the Philippines, surprising everyone.",
    "You experienced recurring back pain, turning to herbal liniments for relief.",
    "You tried a diet of mostly fish and vegetables, hoping for better health.",
    "You worried about leaving an inheritance for your children.",
    "You decided to adopt a senior dog from a local shelter for companionship.",
    "You helped your grandchildren with their school projects using your old knowledge.",
    "You faced a near-death experience but recovered with your family’s support.",
    "You occasionally forgot names and faced mild confusion about current events.",
    "You considered booking a pilgrimage trip to a famous local shrine.",
    "You sang old kundiman songs at a senior talent show, winning second place.",
    "You found joy in crocheting blankets and giving them as gifts.",
    "You joined a neighborly group that does daily morning exercises in the plaza.",
    "You scolded your grandchildren for disrespecting the mano po tradition.",
    "You traveled to your final bucket-list destination in Palawan with your spouse.",
    "You had your lawyer finalize your last will and testament to avoid family disputes.",
    "You grew addicted to watching old Tagalog films on cable TV all day.",
    "You had a misunderstanding about dividing farmland among your children.",
    "You discovered you enjoy painting landscapes of your provincial hometown.",
    "You donated part of your pension to a local orphanage.",
    "You found out a grandchild is moving abroad, causing heartbreak.",
    "You joined a church choir for seniors, performing at Sunday Mass regularly.",
    "You invested in a small poultry farm to keep yourself busy.",
    "You overcame severe pneumonia but felt physically weaker afterward.",
    "You visited old friends’ graves, reminiscing about your younger days.",
    "You tried playing word puzzles daily to keep your mind sharp.",
    "You got upset when a neighbor’s loud karaoke prevented your afternoon nap.",
    "You helped plan a grand family reunion and took group photos for the album.",
    "You nearly forgot to take your maintenance meds for hypertension one day.",
    "You wrote letters to your loved ones, passing on life lessons and blessings."
  ]
}
